Revit 2024 API
Face.Period Property
The period of the underlying surface in the specified parametric direction.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double this[
	int paramIdx
] { get; }
Visual Basic
Public ReadOnly Property Period ( _
	paramIdx As Integer _
) As Double
	Get
Visual C++
public:
property double Period[int paramIdx] {
	double get (int paramIdx);
}
Parameters
paramIdx
Type: System.Int32
Use 0 for U coordinates and 1 for V coordinates.
Return Value
The real number equal to the period of the underlying surface.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  Thrown when an incorrect coordinate dimension is supplied.
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when this face is not cyclic in the specified direction.
See Also
Face Class
Autodesk.Revit.DB Namespace